---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.RebarShapeConstraintSegmentLength
source: html/31976c10-8452-4192-0495-96ea714d54ae.htm
---
# RebarShapeConstraintSegmentLength Members

Create a segment length constraint.